[
    {
      "text": "Пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете",
      "author": "Стив Макконнелл",
      "textEn": "Write code as if it were accompanied by a violent psychopath who knows where you live",
      "authorEn": "Steve McConnell"
    },
    {
      "text": "Сложность программы растет до тех пор, пока не превысит способности программиста",
      "author": "Артур Блох. Законы Мэрфи",
      "textEn": "The complexity of the program grows until it exceeds the ability of the programmer.",
      "authorEn": "Arthur Bloch. Murphy's laws"
    },
    {
      "text": "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили.",
      "author": "Закон Мошера",
      "textEn": "Don't worry if something doesn't work. If everything worked, you would be fired.",
      "authorEn": "Mosher’s Law"
    },
    {
      "text": "В хорошем дизайне добавление чего-то стоит дешевле, чем сама эта вещь.",
      "author": "Томас С. Гейл",
      "textEn": "In good design, adding something costs less than the thing itself.",
      "authorEn": "Thomas C. Gale"
    },
    {
      "text": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода.",
      "author": "Кристофер Томпсон",
      "textEn": "Sometimes it's better to stay home on Monday than to spend the whole week debugging code written on Monday.",
      "authorEn": "Christopher Thompson"
    },
    {
      "text": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
      "author": "Билл Гейтс",
      "textEn": "Measuring a programmer's productivity by counting lines of code is like judging an airplane's build by its weight.",
      "authorEn": "Bill Gates"
    },
    {
      "text": "Отладка кода — это как охота. Охота на баги.",
      "author": "Амит Калантри",
      "textEn": "Debugging code is like hunting. Hunting for bugs.",
      "authorEn": "Amit Kalantri"
    },
    {
      "text": "Иногда лучшие программы создаются на бумажке. Запрограммировать их — второстепенная вещь.",
      "author": "Макс Канат-Александр",
      "textEn": "Sometimes the best programs are written on paper. Programming them is a secondary thing.",
      "authorEn": "Max Kanat-Alexander"
    },
    {
      "text": "Простота — залог надежности.",
      "author": "Эдсгер В. Дейкстра",
      "textEn": "Simplicity is the key to reliability.",
      "authorEn": "Edsger W. Dijkstra"
    },
    {
      "text": "Работает? Не трогай.",
      "author": "Любой программист",
      "textEn": "Works? Do not touch.",
      "authorEn": "Any programmer"
    }
  ]  
